<a href="https://colab.research.google.com/github/jayac251/Machine_Learning/blob/main/Dataframe_duplicated().ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
# mounting google drive
from google.colab import drive
drive.mount("/gdrive")

Mounted at /gdrive

##**Issues**

1. Firstname column has 67 (1000 - 933) null values, similarly gender, Sr. mgmt and Team has null values

2. Sr. Mgmt is imported as string instead of boolean which is light weight

2. Gender's type is string, which shd be categorial type, Male or Female

4. Start date and Last Login Time imported as string ( Doing date calculation cannot be done if it s a string)

In [ ]:
emp = pd.read_csv("/gdrive/My Drive/Colab Notebooks/employees.csv")
emp.head()

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas    Male   8/6/1993  ...   6.945               True        Marketing
1     Thomas    Male  3/31/1996  ...   4.170               True              NaN
2      Maria  Female  4/23/1993  ...  11.858              False          Finance
3      Jerry    Male   3/4/2005  ...   9.340               True          Finance
4      Larry    Male  1/24/1998  ...   1.389               True  Client Services

[5 rows x 8 columns]

In [ ]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

##**Convert Start date, Last login time to date time object**

In [ ]:
emp['Start Date'].head(5)

0     8/6/1993
1    3/31/1996
2    4/23/1993
3     3/4/2005
4    1/24/1998
Name: Start Date, dtype: object

In [ ]:
emp['Start Date'] = pd.to_datetime(emp['Start Date'])

In [ ]:
emp['Last Login Time'] = pd.to_datetime(emp['Last Login Time'])

In [ ]:
emp['Last Login Time']

0     2021-10-08 12:42:00
1     2021-10-08 06:53:00
2     2021-10-08 11:17:00
3     2021-10-08 13:00:00
4     2021-10-08 16:47:00
              ...
995   2021-10-08 06:09:00
996   2021-10-08 06:30:00
997   2021-10-08 12:39:00
998   2021-10-08 16:45:00
999   2021-10-08 18:24:00
Name: Last Login Time, Length: 1000, dtype: datetime64[ns]

##**Convert Sr.mgmt to Boolean object**

In [ ]:
emp['Senior Management'] = emp['Senior Management'].astype('bool')

##**Convert Gender to category object**

In [ ]:
emp['Gender']

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
995       NaN
996      Male
997      Male
998      Male
999      Male
Name: Gender, Length: 1000, dtype: object

In [ ]:
emp['Gender'].astype('category')

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
995       NaN
996      Male
997      Male
998      Male
999      Male
Name: Gender, Length: 1000, dtype: category
Categories (2, object): ['Female', 'Male']

In [ ]:
emp['Gender'] = emp['Gender'].astype('category')

##**.duplicated() method**

In [ ]:
emp.sort_values('First Name', inplace = True)
emp.head()

    First Name Gender Start Date  ... Bonus %  Senior Management             Team
101      Aaron   Male 2012-02-17  ...  11.849               True        Marketing
327      Aaron   Male 1994-01-29  ...   5.097               True        Marketing
440      Aaron   Male 1990-07-22  ...  11.343               True  Client Services
937      Aaron    NaN 1986-01-22  ...  18.424              False  Client Services
137       Adam   Male 2011-05-21  ...  15.120              False     Distribution

[5 rows x 8 columns]

In [ ]:
emp['First Name']

101    Aaron
327    Aaron
440    Aaron
937    Aaron
137     Adam
       ...
902      NaN
925      NaN
946      NaN
947      NaN
951      NaN
Name: First Name, Length: 1000, dtype: object

In [ ]:
emp['First Name'].duplicated().head(20)

101    False
327     True
440     True
937     True
137    False
141     True
302     True
538     True
300    False
53      True
610     True
959    False
999     True
680     True
477     True
458     True
372     True
988    False
970     True
765     True
Name: First Name, dtype: bool

##extract duplicate rows

In [ ]:
emp[emp['First Name'].duplicated()]

    First Name  Gender Start Date  ... Bonus %  Senior Management             Team
327      Aaron    Male 1994-01-29  ...   5.097               True        Marketing
440      Aaron    Male 1990-07-22  ...  11.343               True  Client Services
937      Aaron     NaN 1986-01-22  ...  18.424              False  Client Services
141       Adam    Male 1990-12-24  ...  14.727               True          Product
302       Adam    Male 2007-07-05  ...   5.027               True  Human Resources
..         ...     ...        ...  ...     ...                ...              ...
902        NaN    Male 2001-05-23  ...   6.322               True     Distribution
925        NaN  Female 2000-08-23  ...  19.388               True            Sales
946        NaN  Female 1985-09-15  ...  16.941               True     Distribution
947        NaN    Male 2012-07-30  ...   5.329               True        Marketing
951        NaN  Female 2010-09-14  ...   9.662               True              NaN

[799 rows x 8 columns]

In [ ]:
emp['First Name'].duplicated(keep='last').head(20)

101     True
327     True
440     True
937    False
137     True
141     True
302     True
538    False
300     True
53      True
610    False
959     True
999     True
680     True
477     True
458     True
372    False
988     True
970     True
765     True
Name: First Name, dtype: bool

In [ ]:
emp['First Name'].duplicated(keep=False).head(20)


# the keep parameter accepts an additional argument, 
#and instead of first or last as a string, we can enter false. 
#Now, what false will do is it's going to mark something as duplicated 
#if it occurs more than once. Period. Doesn't matter if it's the first time or the last time. 
#Here we have an example where we have all Aarons. All of these are going to be marked as true.
# True for yes, it is a duplicate because Aaron occurs more than once.

101    True
327    True
440    True
937    True
137    True
141    True
302    True
538    True
300    True
53     True
610    True
959    True
999    True
680    True
477    True
458    True
372    True
988    True
970    True
765    True
Name: First Name, dtype: bool

#extract all the duplicate rows including the first occurrence

In [ ]:
emp[emp['First Name'].duplicated(keep=False)]

#list of all of the duplicates, in the DataFrame, 
#if we extract it, what we can do here is extract only the rows that 
#have more than one duplicate value in the First Name column. 
#So these are all the duplicates. 
#You can see that the Aarons are represented four times and the Aaron name does occur four times.

#extract the unique rows

extract rows that have unique first name which occurs only once

In [ ]:
~emp['First Name'].duplicated(keep=False)

101    False
327    False
440    False
937    False
137    False
       ...
902    False
925    False
946    False
947    False
951    False
Name: First Name, Length: 1000, dtype: bool

In [ ]:
mask = ~emp['First Name'].duplicated(keep=False)
emp[mask].head(20)

    First Name  Gender  ... Senior Management                  Team
8       Angela  Female  ...              True           Engineering
688      Brian    Male  ...              True                 Legal
190      Carol  Female  ...             False               Finance
887      David    Male  ...             False                 Legal
5       Dennis    Male  ...             False                 Legal
495     Eugene    Male  ...             False                 Sales
33        Jean  Female  ...             False  Business Development
832      Keith    Male  ...             False                 Legal
291      Tammy  Female  ...              True       Client Services

[9 rows x 8 columns]

In [ ]:
emp[mask].sort_values('First Name')

    First Name  Gender  ... Senior Management                  Team
8       Angela  Female  ...              True           Engineering
688      Brian    Male  ...              True                 Legal
190      Carol  Female  ...             False               Finance
887      David    Male  ...             False                 Legal
5       Dennis    Male  ...             False                 Legal
495     Eugene    Male  ...             False                 Sales
33        Jean  Female  ...             False  Business Development
832      Keith    Male  ...             False                 Legal
291      Tammy  Female  ...              True       Client Services

[9 rows x 8 columns]